web/app/controllers/notes_controller.rb

  def index
    count = 1
    @pagy, @notes = pagy(Note.where(:user_id => current_user.id).order(created_at: :desc), items: count)
---
SELECT COUNT(*) FROM "notes" WHERE "notes"."user_id" = 1

  def create
    @note = Note.new
    @note.text = params[:text]
    @note.img = params[:img]
    @note.user = current_user

    # Required to generate the id
    @note.validate!

    image_data = @note.img
    image_data = image_data.sub('data:image/png;base64,', '')

    File.open(Rails.root.join('public', 'uploads', "#{@note.id}.png"), 'wb') do |file|
      file.write(Base64.decode64(image_data))
    end

    if @note.save
---
INSERT INTO "notes" ("id", "text", "user_id", "created_at", "updated_at") VALUES ('d0373bff-ad72-4e72-ace0-343e37e692d5', 'NG)